[
  {
    "title": "Jr. UI/UX Designer",
    "company": "DigiTrends",
    "location": "Karachi",
    "salary": "",
    "jobTypes": "Full-time",
    "description": "We are looking for a creative and detail-oriented Junior UI/UX Designer to join our design team. The ideal candidate will assist in designing user-friendly and visually appealing interfaces for web and mobile applications, working under the guidance of senior designers and collaborating with cross-functional teams. This role is perfect for someone passionate about user experience and eager to learn and grow in a fast-paced environment.\n\nKey Responsibilities:\n\nAssist in creating engaging, user-friendly designs for websites and mobile applications.\nWork closely with senior designers to turn requirements into wireframes, prototypes, and polished designs.\nConduct user research and gather insights to inform design decisions.\nParticipate in design discussions and feedback sessions with stakeholders.\nEnsure designs align with the brand’s identity and enhance user experience.\nCollaborate with developers to ensure accurate implementation of design specifications.\nMaintain and update design assets and documentation for future reference.\n\nQualifications:\n\nBachelor’s degree in Graphic Design, Interaction Design, or a related field (or relevant experience).\nBasic understanding of UI/UX design principles, including user-centered design and usability.\nProficiency in design tools such as Adobe XD, Figma, or Sketch.\nFamiliarity with wireframing, prototyping, and visual design principles.\nGood communication skills and attention to detail.\nAbility to work collaboratively in a team environment and take constructive feedback.\n\nKey Benefits\n\nWorking in a fast-paced tech start-up environment\nAttractive salary and incentives for high-quality work\nFlexible schedule\nHealth Insurance\nFive Working Days\nProvident Fund\n\nJob Type: Full-time",
    "job_url": "https://pk.indeed.com/rc/clk?jk=d4a01a210279d329&bb=W4T15OjQF56vXw3RqXZvS922wS4SbB7ycpDAEx3aOHmuR9hfXI3s83xbFehpx49YwfDHCiDhh2Jd4On3HpCyBdBbA9zCEjoVPYM7hQZDa4DWFHWXFVe7ZVMK0bgz0EfKzK2jydzc3anlPHj80ZOjJUNVxS0-Nm-c&xkcb=SoDX67M3w8v7If22qx0LbzkdCdPP&fccid=287ba43c5564da0c&cmp=Digitrends&ti=Ux%2Fui+Designer&vjs=3"
  },
  {
    "title": "Junior Flutter Developer (1–2 Years Experience)",
    "company": "UTF Labs",
    "location": "Karachi",
    "salary": "Rs 50,000 - Rs 70,000 a month",
    "jobTypes": "Rs 50,000 - Rs 70,000 a month, Full-time",
    "description": "We are seeking a passionate and detail-oriented Junior Flutter Developer with 1 to 2 years of experience to join our growing team. In this role, you’ll help develop high-quality cross-platform mobile applications, with a particular focus on iPad-optimized experiences. This is a great opportunity to sharpen your skills and grow alongside a collaborative and supportive team.\n\nKey Responsibilities\n\nAssist in the development and maintenance of mobile applications using Flutter and Dart.\nSupport the creation of responsive and optimized applications for iPad and other tablet devices.\nCollaborate with product managers, designers, and backend developers to deliver user-friendly features.\nHelp integrate RESTful APIs and third-party libraries to extend app functionality.\nTroubleshoot and resolve bugs to ensure smooth app performance.\nWrite clean, scalable, and maintainable code following best practices.\nParticipate in code reviews and contribute to team learning and documentation.\nStay current with the latest Flutter updates and mobile development trends.\n\nRequirements\n\n1–2 years of hands-on experience in mobile app development using Flutter.\nExposure to developing or optimizing apps for iPad or tablet devices.\nProficiency in Dart and understanding of mobile development concepts.\nBasic experience integrating APIs and working with third-party libraries.\nGood grasp of UI/UX principles and the mobile development lifecycle.\nFamiliarity with Git or other version control systems.\nExperience publishing or contributing to apps on the Google Play Store and/or Apple App Store.\nStrong problem-solving abilities and keen attention to detail.\nEagerness to learn and grow within a fast-paced development environment.\n\nJob Type: Full-time\n\nPay: Rs50,000.00 - Rs70,000.00 per month\n\nWork Location: In person\n\nApplication Deadline: 21/06/2025",
    "job_url": "https://pk.indeed.com/rc/clk?jk=e0f4f847be5aa5db&bb=W4T15OjQF56vXw3RqXZvS4zXrNDMKWQSHJUT23HeuI8qyX55TEBzQ7LO81H5qtBuQ0i5nRQw3RNGOpBkhW1F-vCzIxzl6wCQ_vTWZXYmcGFDaOOsffzAnqh2RT33D1LEZGCo9B89PtdJhCIRyL_5qr-hcAH18Yux&xkcb=SoBj67M3w8v7If22qx0KbzkdCdPP&fccid=993c8fcbe86a6a50&cmp=UTF-Labs&ti=Junior+Developer&vjs=3"
  },
  {
    "title": "Junior MERN Stack Developer (Part-Time, On-Site – Karachi Only)",
    "company": "Ascentedge Technologies & Consulting",
    "location": "Karachi",
    "salary": "",
    "jobTypes": "Part-time",
    "description": "Please read the requirements carefully. Applications that do not match will not be considered.\n\nAbout Us\nAscentedge Technologies & Consulting is a Karachi-based digital solutions company, delivering results-driven web and mobile apps, UI/UX design, and digital marketing. We thrive on collaboration, creativity, and delivering impact for our clients.\n\nAbout the Role\nWe’re looking for a Junior MERN Stack Developer to join our team part-time, on-site in Karachi. This is a 4-hour/day opportunity during EST time zone hours – ideal for candidates who already have 6 months to 1 year of hands-on MERN experience and are eager to learn in a professional environment.\n\nImportant Note:\nThis is not a remote or freelance role. Please apply only if you can commute to our office in Karachi and are available during EST hours.\n\nKey Responsibilities\n\nBuild and maintain web apps using MongoDB, Express.js, React.js, and Node.js\nWork with designers and product teams to implement new features\nWrite clean, modular, and scalable code\nDebug and optimize performance issues\nTake ownership of your tasks and deliver on time\n\nYou Should Have\n\n6 months to 1 year of practical experience in the MERN stack\nSolid understanding of JavaScript, HTML, and CSS\nFamiliarity with Git and REST APIs\nStrong communication and problem-solving skills\nAvailability to work 4 hours/day on-site in Karachi during EST hours\nWillingness to grow in a fast-moving, collaborative startup environment\n\nJob Type: Part-time\n\nExpected hours: 20 per week\n\nApplication Question(s):\n\nWe need to fill this position urgently. Can you start immediately? If you can't join within 1 week, please do not apply.\nWhat are your salary expectations for this position?\nHow many months of hands-on experience do you have working with the MERN stack?\nAre you available to work on-site in Karachi during EST time zone hours (4 hours/day)?\n\nWork Location: In person\n\nApplication Deadline: 09/07/2025",
    "job_url": "https://pk.indeed.com/rc/clk?jk=fa5f904c5f90519e&bb=W4T15OjQF56vXw3RqXZvSzU6ENkd8RZ-ST1djHet2eToMviBu9yWLM7-rHgUF2zKlaga524138JMB_Yw6-n3alirihGeHNWAZcT7Y7rUvTi2Sa6zgdKqoZxZ6o9uoe2sWdV_C56Inxrk6hxoL8xWtVevrnNgInhU&xkcb=SoD-67M3w8v7If22qx0JbzkdCdPP&fccid=773fd8b190295d3f&cmp=Ascentedge-Technologies-%2526-Consulting&ti=Junior+Developer&vjs=3"
  },
  {
    "title": "Jr. Flutter Developer",
    "company": "MeezoTech",
    "location": "Karachi",
    "salary": "Rs 50,000 - Rs 80,000 a month",
    "jobTypes": "Rs 50,000 - Rs 80,000 a month, Full-time",
    "description": "We are looking for a passionate and proactive Junior Flutter Developer to join our development team. As a junior team member, you will work under the guidance of senior developers to design and build cross-platform mobile applications using the Flutter framework. This is a great opportunity to grow your skills in a supportive, fast-paced environment.\n\nKey Responsibilities\n\nAssist in the development and maintenance of cross-platform mobile applications using Flutter.\nCollaborate with UI/UX designers to translate designs into high-quality code.\nWrite clean, maintainable, and efficient code.\nPerform unit and integration testing.\nDebug and resolve technical issues and bugs.\nStay up to date with new trends and best practices in mobile development.\n\nRequirements\n\nBasic knowledge of Flutter and Dart programming language.\nUnderstanding of REST APIs, third-party integrations, and Firebase.\nFamiliarity with Git version control.\nGood problem-solving skills and a willingness to learn.\nAbility to work both independently and as part of a team.\nStrong communication skills.\n\nPreferred (Nice to Have)\n\nAny published Flutter app on Play Store or App Store.\nExperience with Firebase, Push Notifications, and local storage.\nKnowledge of state management techniques like Provider, BLoC, or Riverpod.\nInternship or project experience with Flutter.\n\nEducation\n\nBachelor’s degree in Computer Science, Software Engineering, or a related field (final-year students may also apply).\n\nWhat We Offer\n\nFriendly and collaborative work environment\nGrowth opportunities and mentorship\nFlexible hours (if applicable)\nCompetitive salary based on experience\n\nJob Type: Full-time\n\nPay: Rs50,000.00 - Rs80,000.00 per month\n\nWork Location: In person",
    "job_url": "https://pk.indeed.com/rc/clk?jk=681a14240255caef&bb=W4T15OjQF56vXw3RqXZvSx6rELQBqQCvuk-CQEIcdAf9pkRxNUI7XAXiD5gDxT9NHKMivj3e-BQOkA3YWeCYkhIO5mBIDb1L_B3_-K4pq8aD7zFJe2qSRgWP6VcmDRlVpIbtklTfF4Bme7vu1xvkAtg9Ux6o8FME&xkcb=SoBK67M3w8v7If22qx0IbzkdCdPP&fccid=233de0053a064333&cmp=MeezoTech&ti=Junior+Developer&vjs=3"
  },
  {
    "title": "Junior Graphic Designer",
    "company": "Tens Sourcing",
    "location": "Karachi",
    "salary": "",
    "jobTypes": "Full-time",
    "description": "About the Company:\n\nTens Sourcing is a fast-growing e-commerce service provider specializing in empowering e-commerce brands to achieve their full potential. Our services include listing optimization, advertising strategy, brand management, and more. We are currently managing the best seller brand Tens Towels on Amazon.\n\nPosition Title: Junior Graphic Designer\n\nCompany: Tens Sourcing\n\nLocation: DHA Phase 8, Karachi, Pakistan (On-site)\n\nJob Timings: Monday – Saturday 10:00 AM to 7:00 PM\n\nJob Type: Full-Time (On-site)\n\nExperience Required: 6 months – 1 year (Fresh graduates with strong portfolios may apply)\n\nJob Summary:\n\nWe are hiring a Junior Graphic Designer to assist in creating visually appealing and brand-consistent designs for Amazon listings, marketing campaigns, and social media. The ideal candidate should have a good aesthetic sense, attention to detail, and the ability to work in a fast-paced e-commerce environment.\n\nKey Responsibilities:\n\nDesign, edit and finalize product images, infographics, and A+ Content for Amazon listings.\nAssist in developing creative assets for social media, email campaigns, and website banners.\nWork closely with the photography, content and marketing team to translate ideas into high-quality visuals.\nEnsure all designs follow brand guidelines and Amazon compliance standards.\nParticipate in brainstorming sessions and contribute fresh, creative design ideas.\nEdit and retouch product photos\nKeep up with design trends relevant to e-commerce and the home decor niche.\n\nRequirements:\n\nProficiency in Adobe Photoshop, Illustrator, and Canva.\nBasic understanding of Amazon image requirements.\nStrong design sense with the ability to balance creativity and clarity.\nAbility to work with feedback and make revisions quickly.\nGood communication and time management skills.\nA portfolio showcasing previous design work is mandatory.\nExperience designing Amazon A+ Content is a plus.\nMotion graphics or basic video editing knowledge.\nFamiliarity with Amazon tools or UI/UX principles.\n\nJob Type: Full-time\n\nEducation:\n\nBachelor's (Required)\n\nExperience:\n\nGraphic Designing: 1 year (Required)\n\nLocation:\n\nKarachi (Required)",
    "job_url": "https://pk.indeed.com/rc/clk?jk=e864f1200d49500f&bb=W4T15OjQF56vXw3RqXZvS0Ql62OSaYqW4Nbe9TmmXXccDWJM2u3edTsrqucagdcAfrIa9nOYpzR0Xd9hHDZC3YDLSWoHNZYVlZWQ4fzswZObmpuLbxBitVRONWJZ1gWTRay-wicm6LEFyryOBQOnnhusv5pApkdA&xkcb=SoDE67M3w8v7If22qx0PbzkdCdPP&fccid=9a8d54d770c2060e&cmp=Tens-Sourcing&ti=Junior+Graphic+Designer&vjs=3"
  },
  {
    "title": "Junior Php and laravel developer",
    "company": "MeezoTech",
    "location": "Karachi",
    "salary": "",
    "jobTypes": "Full-time",
    "description": "Job Summary:\n\nWe are looking for a Junior PHP Laravel Developer to join our development team. In this role, you’ll assist in building and maintaining web applications using Laravel and PHP. This is a great opportunity for someone with foundational development experience who is eager to learn and grow in a collaborative environment.\n\nResponsibilities:\n\nAssist in the development and maintenance of Laravel-based web applications\nWrite clean, secure, and well-documented PHP code\nWork with front-end developers and UI/UX designers to implement features\nIntegrate third-party services and APIs\nCollaborate on troubleshooting, debugging, and performance optimization\nManage and maintain databases using MySQL or similar technologies\nParticipate in code reviews and team meetings\nStay updated with new technologies and best practices.\n\nJob Type: Full-time\n\nWork Location: In person",
    "job_url": "https://pk.indeed.com/rc/clk?jk=2f0e2991608b1ef4&bb=W4T15OjQF56vXw3RqXZvS75uaQ7tB5ipQmkzqLpRunAuJM2zW_cyGkGFmg1o3fIcfNrNWOlJ8EXh5xZM9jPlVMLqi8tphCbR67KBC3TH8tW3E7BefzNfXVLFjpEXTiXxUOOc21J_dAfegQQnVkZufTasrBgnWyxp&xkcb=SoBw67M3w8v7If22qx0ObzkdCdPP&fccid=233de0053a064333&cmp=MeezoTech&ti=PHP+Developer&vjs=3"
  },
  {
    "title": "Web Developer",
    "company": "Chapal",
    "location": "Karachi",
    "salary": "",
    "jobTypes": "Full-time",
    "description": "Job Information\n\nDivision: Online\n\nAge Bracket: 30-36 years\n\nPosition Available: 1\n\nShift Schedule: Mon-Fri 10:00 AM-7:00 PM\n\nArea: Block 9, Clifton\n\nChapal is an emerging yet a globally-recognized company providing a reliable platform to deploy cloud infrastructure using high-end and purpose-built data centres. Probably having the fastest cloud platform across the world, the rapidly-growing startups and large enterprises trust Chapal to run their databases and applications with minimum latency in order to become faster, more innovative and agile. With us, the clients get to discover and break the boundaries of scalability, performance and reliability. Our platform is ideal for high-end traffic platforms where availability is critical. In short, we build custom solutions that matches the unique needs of our clients. As our client base is rapidly growing and covers every industry there is, Chapal is becoming one of the leading cloud service providers operating from Pakistan.\n\n\nRole Overview\nChapal is looking for an attentive Web Developer who has a knack for development. The candidate should be primarily proficient in server-side web development and have experience in front-end development using HTML, CSS and client-side scripting. The developer will be working to maintain, update and enhance application by understanding the requirements tailed for better interface.\n\nJob Responsibilities\n\nTranslate project requirements into functional and visually appealing application solutions\nDevelop responsive and interactive applications using modern front-end technologies; HTML, CSS, JavaScript and frameworks; React or Angular\nImplement efficient back-end functionality using server-side technologies; PHP and connect front-end interfaces to databases and APIs\nCreate intuitive and visually appealing interfaces using industry best practices and design principles\nCollaborate with UI/UX designers to ensure seamless integration of design elements into the development process\nOptimise web application performance, considering factors like page load speed, responsiveness and browser compatibility\nConduct thorough testing of web applications to identify and fix bugs, ensuring optimal functionality and user experience\nPerform cross-browser and cross-platform testing to ensure consistent performance across different environments\nWork on quality assurance by developing and executing testing strategies and ensure high-quality deliverables\nUtilise version control systems to manage code repositories and facilitate collaboration within the team\nDeploy web applications to hosting environments, ensuring proper configuration and adherence to security best practices\nMonitor and troubleshoot deployment issues to resolve any technical challenges\nParticipate in code reviews, provide constructive feedback and continually seek opportunities to enhance code quality and maintainability\nShare knowledge and contribute to the growth and skill development of junior developers within the team\n\n\n\n\nJob Requirements\n\nBachelor's degree in Computer Science, Software Engineering or an equivalent degree in the relevant field\nMinimum of 5+ years of work experience as a Web Developer\nExpertise in front-end and back-end development\nStrong proficiency in HTML, CSS, JavaScript, and front-end frameworks/libraries (React, Angular Js)\nExperience with server-side technologies and PHP frameworks\nFamiliarity with SQL database management system and RESTful API integration\nKnowledge of responsive design principles, UI/UX best practices and cross-browser compatibility\nFamiliarity with version control systems and agile development methodologies\nExcellent problem-solving and analytical skills, with the ability to troubleshoot complex issues and propose effective solutions\nStrong communication skills in English Language\n\n\n\nFacebook | X | Instagram | YouTube | LinkedIn | Snapchat | TikTok | Google Business",
    "job_url": "https://pk.indeed.com/rc/clk?jk=5cf4858526ad1a57&bb=W4T15OjQF56vXw3RqXZvS3ODK9FnKxuD78j-82UDixK2SNN7IF1MDLjz-kAR2E0dozQO2DOCfDj0VZYBCX0zbVcDmIax-uWUIa1AbflExE2GbMTBLMPArihvw75b5-e36pam08Ldnr7NfT_u_48sID-qfTPxaRe4&xkcb=SoDt67M3w8v7If22qx0NbzkdCdPP&fccid=fc4ca34e7e15c6b6&vjs=3"
  },
  {
    "title": "Senior Mobile App Developer (Flutter)",
    "company": "Octdaily",
    "location": "Karachi",
    "salary": "",
    "jobTypes": "Full-time",
    "description": "Job Summary:\n\nWe are seeking a highly skilled and experienced Senior Mobile App Developer with a strong focus on Flutter to join our dynamic team. In this role, you will be responsible for the design, development, and maintenance of robust and scalable mobile applications for iOS and Android platforms.\n\nResponsibilities:\n\nDesign, develop, and maintain robust and scalable mobile applications for iOS and/or Android platforms using Flutter.\nImplement complex features and functionalities, ensuring high performance and responsiveness.\nIntegrate with RESTful APIs and other backend services.\nTroubleshoot and resolve complex technical issues.\nLead the development of specific projects or modules.\nConduct code reviews and provide constructive feedback to team members.\nMentor and guide junior developers, fostering their professional growth.\nContribute to architectural discussions and decisions.\nCollaborate with product managers, designers, and other stakeholders to define and refine project requirements.\nCommunicate effectively with team members and other departments.\nParticipate in agile development processes, including sprint planning, daily stand-ups, and retrospectives.\nWrite and maintain unit and integration tests.\nEnsure adherence to coding standards and best practices.\nPerform thorough testing and debugging to identify and resolve issues.\nParticipate in testing and deployment of CI/CD pipelines.\nStay up-to-date with the latest mobile development trends and technologies.\nProactively identify and recommend improvements to processes and technologies.\nContribute to the development of reusable components and libraries.\n\nQualifications:\n\nBachelor's degree in Computer Science, Software Engineering, or a related field (or equivalent experience).\n5+ years of professional experience in mobile application development.\n4+ years of experience with Flutter framework.\nProven experience in designing, developing, and deploying mobile applications for iOS and Android.\nStrong understanding of mobile UI/UX principles.\nSolid understanding of object-oriented programming principles and design patterns.\nExperience with state management solutions (e.g., Provider, Riverpod, Bloc).\nExperience with version control systems (e.g., Git).\nExcellent problem-solving and debugging skills.\nStrong communication and collaboration skills.\nExperience with native mobile development (iOS or Android) in addition to Flutter.\nExperience with cloud platforms (e.g., AWS, Azure, Google Cloud).\nAbility to work independently and as part of a team.",
    "job_url": "https://pk.indeed.com/rc/clk?jk=48f2b33a37b16cfe&bb=W4T15OjQF56vXw3RqXZvS_B4K7_Gbn7rFBJ6LZuLtL6QqNQY2P3Vd_0VAfrY2VEAl_K-E9ILIATIxT9RqZxx8jmliho3PicbbYC6qX9FW5nbJMz0DjoqNMDqtKO6AAzKgmEmeGf_nP_yX8qxQAHwsOo5egKZAhMy&xkcb=SoBZ67M3w8v7If22qx0MbzkdCdPP&fccid=47da8725df157fbe&vjs=3"
  },
  {
    "title": "Senior Consultant - Application Development",
    "company": "Systems Limited",
    "location": "Karachi",
    "salary": "",
    "jobTypes": "",
    "description": "Role Overview:seeking a highly skilled and experienced Senior MEAN Stack Developer to join our dynamic team. The ideal candidate will specialize in developing micro frontends using Angular and microservices using Node.js, Express, and MongoDB. You will play a key role in designing, developing, and maintaining scalable, modular, and high-performance applications while ensuring seamless integration across the front-end and back-end systems.\n\n\n\n\nKey Responsibilities:1. Micro frontend Development (Angular):o Architect and develop modular micro frontends using Angular.o Implement dynamic and reusable UI components to ensure scalability and maintainability.o Optimize front-end performance for seamless user experiences.o Collaborate with UI/UX designers to translate designs into responsive web applications.\n\n2. Microservices Development (Node.js, Express, MongoDB):o Design and develop scalable microservices using Node.js and Express.o Build RESTful APIs and integrate them with front-end applications.o Implement database schemas and queries using SQL & NoSQL MongoDB for efficient data storage and retrieval.o Ensure high availability, fault tolerance, and security of microservices.\n\n3. System Architecture and Design:o Develop and maintain a modular architecture that supports micro frontends and microservices.o Ensure proper communication and data flow between micro frontends and microservices.\n\n4. Code Quality and Best Practices:o Write clean, maintainable, and well-documented code following industry best practices.o Conduct code reviews and mentor junior developers.o Implement unit testing, integration testing, and end-to-end testing to ensure application reliability.\n\n5. Performance Optimization:o Monitor and optimize application performance, scalability, and reliability.o Identify and resolve bottlenecks in both front-end and back-end systems.6. Continuous Improvement:o Stay updated with the latest trends and technologies in MEAN stack development.o Proactively suggest improvements to existing systems and processes.\n\nRequired Skills and Qualifications:\n\n\n\n\nTechnical Skills:o Front-End: Expertise in Angular (version 13+), TypeScript, HTML5, CSS3, and RxJS.o\nBack-End: Proficiency in Node.js, Express.js, and RESTful API development.o\nDatabase: Strong knowledge of Oracle, MongoDB, including schema design and query optimization.o\nMicro frontends: Experience in designing and implementing micro frontendarchitectures.o\nMicroservices: Hands-on experience in building and deploying microservices.o\nVersion Control: Proficiency in Git and Git-based workflows.2.\nExperience:o Minimum 5+ years of experience in MEAN stack development.o Proven track record of developing micro frontends and microservices.o Experience with Agile methodologies and DevOps practices.",
    "job_url": "https://pk.indeed.com/rc/clk?jk=64250bf1a530e1e3&bb=W4T15OjQF56vXw3RqXZvS7kuTIMv7RR3F2SRoewXLp2-0K_xHlihkrUTHsQHrR4KoOdkK7wSsfTHUEqUfKEufMTzZWOQLRhC_ZRWx0GyoTX6nJG7V6tPxB7YVEEmno1lN-54jOi06YXCkheE9z7oMVz1-uhdg6v9&xkcb=SoCw67M3w8v7If22qx0DbzkdCdPP&fccid=513d00e337655aaf&vjs=3"
  },
  {
    "title": "Team Lead .Net Developer",
    "company": "Team Zeta (Hiring Agency)",
    "location": "Karachi",
    "salary": "Rs 300,000 - Rs 350,000 a month",
    "jobTypes": "Rs 300,000 - Rs 350,000 a month, Full-time",
    "description": "We are looking for a Team LEAD Developer with a strong foundation in .NET MVC and modern development practices. This is an exciting opportunity for someone who is not only technically proficient but also energetic, proactive, and passionate about building high-quality software solutions.\n\nYou will work closely with cross-functional teams to design, develop, and maintain robust applications, while also mentoring junior developers and contributing to architectural decisions.\n\nKey Responsibilities:\n\nDesign, develop, test, and maintain scalable applications using .NET MVC , Core.\n\nCollaborate with product managers, UI/UX designers, and QA engineers to deliver features that meet business needs.\n\nWrite clean, maintainable, and efficient code following best practices.\n\nParticipate in code reviews, architecture discussions, and continuous improvement initiatives.\n\nTake ownership of end-to-end feature delivery.\n\nMentor and guide junior developers.\n\nStay updated with the latest industry trends and advocate for modern development practices.\n\nRequired Skills & Qualifications:\n\n4+ years of professional experience in software development.\n\nStrong expertise in .NET MVC, C#, and Abstract method .\n\nProficiency in front-end frameworks (e.g., Angular, React, or Blazor) is a plus.\n\nExperience with RESTful APIs, SQL Server, and Entity Framework.\n\nFamiliarity with cloud platforms (preferably Azure or AWS).\n\nStrong understanding of software design patterns, data structures, and algorithms.\n\nExperience with CI/CD, version control systems (e.g., Git), and Agile methodologies.\n\nExcellent problem-solving skills and attention to detail.\n\nEnergetic, enthusiastic, and eager to learn and grow in a collaborative environment.\n\nJob Type: Full-time\n\nPay: Rs300,000.00 - Rs350,000.00 per month\n\nApplication Question(s):\n\nWhat is expected salary?\n\nExperience:\n\nTeam Lead: 1 year (Preferred)\n.NET MVC : 4 years (Preferred)\n\nWork Location: In person",
    "job_url": "https://pk.indeed.com/rc/clk?jk=3a916838e2d776b2&bb=W4T15OjQF56vXw3RqXZvS2MG9gt2EaoVBQ7a-OR60cji2ptGs1efgPMlFdzVGd48FzOalNwK8svm_39DxEvqh5pbWLv0rTgmemw6oKGNSZx_KPY8UDfSVVq3qOupIA00xDCaiSeDRAq-l7ZbznhjnovZQzBk8OwK&xkcb=SoAE67M3w8v7If22qx0CbzkdCdPP&fccid=54da5330c09c7cae&cmp=Team-Zeta-%28Hiring-Agency%29&ti=.NET+Developer&vjs=3"
  },
  {
    "title": "Senior Flutter Developer",
    "company": "XAutonomous L.L.C",
    "location": "Karachi",
    "salary": "",
    "jobTypes": "Full-time",
    "description": "We are looking for a Senior Flutter Developer to lead the development of high-performance, scalable, and visually engaging mobile applications. You will work closely with cross-functional teams including product managers, UI/UX designers, and backend developers to deliver innovative solutions that meet business objectives.\n\nKey Responsibilities:\n\nDesign and build advanced mobile applications using Flutter for both Android and iOS.\nLead architecture and design discussions for new features and apps.\nWrite clean, maintainable, and testable code with best practices in mind.\nCollaborate with cross-functional teams to define, design, and ship new features.\nEnsure the performance, quality, and responsiveness of applications.\nIdentify and correct bottlenecks and fix bugs.\nMentor junior developers and contribute to team knowledge sharing.\nStay up to date with the latest Flutter releases, libraries, and best practices.\n\nRequired Skills & Qualifications:\n\nBachelor's degree in Computer Science or related field (or equivalent experience).\n4+ years of mobile development experience.\nStrong understanding of Dart and Flutter architecture (BLoC, Provider, Riverpod, etc.).\nExperience with RESTful APIs, third-party libraries, and Firebase.\nProficient in Git, Agile methodologies, and CI/CD practices.\nExperience with platform-specific integrations (native modules in Android/iOS).\nStrong debugging and optimization skills.\n\nPreferred Qualifications\n\nExperience in publishing apps to Google Play and App Store.\nFamiliarity with automated testing and performance tuning.\nKnowledge of state management patterns.\nContributions to open-source Flutter projects or published personal projects.\n\nLocation: Bahria Town, Karachi.\n\nTransportation provided for the following locations: Sohrab Goth, Ayesha Manzil, Yaseenabad, Rub Medical Center, Gulshan Chowrangi, Luckey One Shopping Mall, 5 Star Chowrangi, Nagan Chowrangi, Power House Chowrangi, Shafeeq More, Model Colony, Malir halt, Rafah-e-Aam Society, Colony Gate, Scheme 33, Safoora Goth, CP 5 / CP 6 Malir Cantt.\n\nJob Type: Full-time\n\nApplication Question(s):\n\nRate yourself in Flutter architecture out of 10.\nRate yourself in Dart out of 10.\nRate your proficiency in Git, Agile methodologies, and CI/CD practices.\nPlease mention your full address with the specified sector or block and the nearest landmark to your location.\n\nExperience:\n\nFlutter and Dart programming languages: 3 years (Required)\nfull mobile development life cycle: 2 years (Required)\nRESTful APIs, third-party libraries, and Firebase.: 2 years (Preferred)\n\nWork Location: In person\n\nApplication Deadline: 06/07/2025",
    "job_url": "https://pk.indeed.com/rc/clk?jk=468c50092319ee65&bb=W4T15OjQF56vXw3RqXZvS7U2S1Lk2OXZMp319y_YuU2g0QCPWFpj5slxSHluo0r_zNlz-AzAkCp_uUT2_GOPy-fHE6xyQAeu4646D42APLJVE0KfdPDda9Q8NT-2oVt2br1Ov5k9kdo0oXAhYl2tjNYZcU5tn5Lb&xkcb=SoCZ67M3w8v7If22qx0BbzkdCdPP&fccid=2830c0a614d3317b&cmp=XAutonomous&ti=Senior+Developer&vjs=3"
  }
]